///
// مشکل که الان وجود داره برای انتخاب گزینه های ای آی هست که وقتی انتخاب میکنیم به گزینه اول تغییر میکنه و تا آخر با گزینه
// می میونه و ثابت وای نمیایسته.
// به احتمال زیاد راه حلی که پیاده سازی شد جواب داده

// حل شد.

///
// باید موقع پاک کردن چت قسمت مربوط به رفتن به اسلش چت رو در حافظه جاگذاری کنیم. یعنی کاربر دیگه نتونه با دکمه برگشت به صفحه ای که پاک شده دسترسی پیدا کنه

// حل شد.

///
// بعضی مواقع برای گرفتن چت های قدیمی عملیات فتچ درست انجام نمیشه. فکر کنم باید برای کانوکس قسمتی که مربوط به ریتری هست رو پیاده سازی کنیم.

// فکر کنم باید یک لوکال دیتابیس مثل ایندکس دی بی رو براش پیاده سازی کنم
