// json: '{\n' +
// '  "id": "«r3»",\n' +
// '  "message": {\n' +
// '    "id": "iSnNYg1Pse3HHskz",\n' +
// '    "createdAt": "2025-05-24T10:59:53.939Z",\n' +
// '    "role": "user",\n' +
// '    "content": "میتونی درباره فیلم ارباب حلقه ها چند خط بنویسی",\n' +
// '    "parts": [\n' +
// '      {\n' +
// '        "type": "text",\n' +
// '        "text": "میتونی درباره فیلم ارباب حلقه ها چند خط بنویسی"\n' +
// '      }\n' +
// '    ]\n' +
// '  }\n' +
// '}'




{
    messages: '[\n' +
      '  {\n' +
      '    "role": "user",\n' +
      '    "content": "سلام من سینا هستم",\n' +
      '    "parts": [\n' +
      '      {\n' +
      '        "type": "text",\n' +
      '        "text": "سلام من سینا هستم"\n' +
      '      }\n' +
      '    ]\n' +
      '  },\n' +
      '  {\n' +
      '    "role": "assistant",\n' +
      '    "content": "سلام سینا! خوش آمدید. چگونه می خواهم به شما کمک کنم؟",\n' +
      '    "parts": [\n' +
      '      {\n' +
      '        "type": "step-start"\n' +
      '      },\n' +
      '      {\n' +
      '        "type": "text",\n' +
      '        "text": "سلام سینا! خوش آمدید. چگونه می خواهم به شما کمک کنم؟"\n' +
      '      }\n' +
      '    ]\n' +
      '  },\n' +
      '  {\n' +
      '    "role": "user",\n' +
      '    "content": "سه خط درباره فیلم فایت کلاب بنویس",\n' +
      '    "parts": [\n' +
      '      {\n' +
      '        "type": "text",\n' +
      '        "text": "سه خط درباره فیلم فایت کلاب بنویس"\n' +
      '      }\n' +
      '    ]\n' +
      '  },\n' +
      '  {\n' +
      '    "role": "assistant",\n' +
      '    "content": "**فایت کلاب**\\nفایت کلاب یک فیلم اکشن و کومدی است که در سال 2022 منتشر شد. این فیلم به کارگردانی جک اوچتلا و با بازی جک بلک، میشل رپو، و استیو کاوانو به صحنه می‌رود.\\n\\n**مخاطب و Reception**\\\nاین فیلم به طور کلی به عنوان یک فیلم मजेदار و سرگرم به حساب می‌آید که می‌توانست برای تماشای آن به همراه دوس  ستان خود بروید.",\n' +
      '    "parts": [\n' +
      '      {\n' +
      '        "type": "step-start"\n' +
      '      },\n' +
      '      {\n' +
      '        "type": "text",\n' +
      '        "text": "**فایت کلاب**\\nفایت کلاب یک فیلم اکشن و کومدی است که در سال 2022 منتشر شد. این فیلم به کارگردانی جک اوچتلا و با بازی جک بلک، میشل رپو، و استیو کاوانو به صحنه می‌رود.\\n\\n**مخاطب و Reception**\\\nاین فیلم به طور کلی به عنوان یک فیلم मजेदار و سرگرم به حساب می‌آید که می‌توانست برای تماشای آن به همراه دو  وستان خود بروید."\n' +
      '      }\n' +
      '    ]\n' +
      '  },\n' +
      '  {\n' +
      '    "role": "user",\n' +
      '    "content": "اسم من چی هست؟",\n' +
      '    "parts": [\n' +
      '      {\n' +
      '        "type": "text",\n' +
      '        "text": "اسم من چی هست؟"\n' +
      '      }\n' +
      '    ]\n' +
      '  }\n' +
      ']'
  }